app/views/users/show.html.erb

SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 29], ["LIMIT", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 29]]
---
			    <br/><br/><br/><br/><br/><br/>
			    <% if @user.microposts.any? %>
			      <h4>You have <%= @user.microposts.count %> posts so far !</h4>