app/views/microposts/_microposts.html.erb

  <table>
   <% @user.microposts.each do |micropost| %>
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" ASC  [["user_id", 29]]