app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts" ORDER BY created_at DESC
---
  def index
    @microposts = Micropost.all

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "My First Tweet..."], ["user_id", 1], ["created_at", "2018-07-30 05:32:58.413028"], ["updated_at", "2018-07-30 05:32:58.413028"]]
---
  def create
    @micropost = Micropost.new(micropost_params)
    if @micropost.content != nil && @micropost.content != ''
      if @micropost.save

UPDATE "microposts" SET "content" = ?, "updated_at" = ? WHERE "microposts"."id" = ?  [["content", "Second Tweet !!!"], ["updated_at", "2018-07-30 06:15:09.217143"], ["id", 3]]
---
  def update
    if @micropost.update(micropost_params)

DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 18]]
---
  def destroy
    if @micropost.destroy

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
    def set_micropost
      @micropost = Micropost.find(params[:id])